back-end/app/controllers/api/v1/songs_controller.rb

  def update
    @song.update(song_params)
---
UPDATE "songs" SET "username" = ?, "score" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["username", "not helen"], ["score", 493], ["updated_at", "2018-05-10 13:45:45.254616"], ["id", 2]]

  def set_params
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]